&НаКлиенте
Перем Гугл;

&НаКлиенте
Функция Гугл()
	Если ТипЗнч(Гугл) <> Тип("УправляемаяФорма") Тогда
		ИнициализироватьГуглАналитику()
	КонецЕсли;
	Возврат Гугл;
КонецФункции

&НаКлиенте
Процедура ИнициализироватьГуглАналитику()
	ПараметрыФормы		= Новый Структура;
	ПараметрыФормы.Вставить("ОбъектПараметрыКлиентСервер", Объект.ПараметрыКлиентСерверGA);
	ПолныйПутьКФорме	= Объект.ПараметрыКлиентСерверМетрика.ПутьКФормам + "GoogleAnalytics";
	
	Гугл			= ПолучитьФорму(ПолныйПутьКФорме, ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбработикаОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ПараметрыКлиентСерверМетрика = ОбработикаОбъект.ИнициализироватьПараметрыКлиентСервер(ЭтаФорма);
КонецПроцедуры
