Процедура ИнициализироватьПараметрыКлиентСервер(ОсновнаяФорма = Неопределено) Экспорт
	ПараметрыКлиентСервер = Новый Структура;
	
	ПараметрыКлиентСервер.Вставить("АдресаВХ");
	
	ПараметрыКлиентСервер.Вставить("ВерсияПлатформы1С");
	ПараметрыКлиентСервер.Вставить("ИмяКонфигурации1С");
	ПараметрыКлиентСервер.Вставить("НомерРелизаМодуля1С");
	
	ПараметрыКлиентСервер.Вставить("КэшироватьОбработкуОбъект");
	
	ПараметрыКлиентСервер.Вставить("ТипИспользуемыхФорм");
	ПараметрыКлиентСервер.Вставить("МодальностьЗапрещена");
	ПараметрыКлиентСервер.Вставить("ИспользоватьАсинхроннуюМодельРаботы");
	
	УникальныйИдентификатор	= ПолучитьУникальныйИдентификаторДляВХ(ОсновнаяФорма);
	
	АдресаВХ = Новый Структура;
	АдресаВХ.Вставить("СоединениеГугл",		ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));	//Структура с ключом Соединение
	АдресаВХ.Вставить("ОбработкаОбъект",	ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор));	//Структура с одним элементом: ключ = "ОбработкаОбъект", значение	= объект [Внешняя]ОбработкаОбъект.КонтурСверкаВзаиморасчетов
	
	ПараметрыКлиентСервер.АдресаВХ					= АдресаВХ;
	
	ПараметрыКлиентСервер.ВерсияПлатформы1С			= ВерсияПлатформы1С();
	ПараметрыКлиентСервер.ИмяКонфигурации1С			= ИмяКонфигурации1С();
	ПараметрыКлиентСервер.НомерРелизаМодуля1С		= НомерРелизаМодуля1С();
	
	ПараметрыКлиентСервер.КэшироватьОбработкуОбъект	= ДоступноКэшированиеОбработкиОбъекта();
	
	ПараметрыКлиентСервер.ТипИспользуемыхФорм		= ТипИспользуемыхФорм(ОсновнаяФорма);
	ПараметрыКлиентСервер.МодальностьЗапрещена		= МодальностьЗапрещена();
	ПараметрыКлиентСервер.ИспользоватьАсинхроннуюМодельРаботы = ИспользоватьАсинхроннуюМодельРаботы();
КонецПроцедуры