&НаСервере
Перем МодульОбъекта;
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.ПараметрыКлиентСервер = МодульОбъекта().ИнициализироватьПараметрыКлиентСервер(ЭтаФорма);
	МодульОбъекта().КэшироватьОбработкуОбъект();
КонецПроцедуры

&НаСервере
Функция МодульОбъекта()
	
	Если МодульОбъекта = Неопределено Тогда
		
		КэшироватьОбработкуОбъект = Ложь; //при старте модуля ПараметрыКлиентСервер могут быть еще не инициализированы
		Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда 
			КэшироватьОбработкуОбъект = Объект.ПараметрыКлиентСервер.КэшироватьОбработкуОбъект = Истина;
		КонецЕсли;
		Если КэшироватьОбработкуОбъект Тогда
			МодульОбъекта = МодульОбъектаИзКэша();
		КонецЕсли;
		
		Если МодульОбъекта = Неопределено Тогда
			МодульОбъекта = РеквизитФормыВЗначение("Объект");
		КонецЕсли;
		
	КонецЕсли;	
	
	Возврат МодульОбъекта;
	
КонецФункции

&НаСервере
Функция МодульОбъектаИзКэша()
	
	Результат = Неопределено;
	
	Если ТипЗнч(Объект.ПараметрыКлиентСервер) = Тип("Структура") Тогда
		АдресВХ = Объект.ПараметрыКлиентСервер.АдресаВХ.ОбработкаОбъект;
 		Если ЭтоАдресВременногоХранилища(АдресВХ) Тогда
			Структура = ПолучитьИзВременногоХранилища(АдресВХ);
			Если ТипЗнч(Структура) = Тип("Структура") и Структура.Свойство("ОбработкаОбъект") Тогда
			 	Результат = Структура.ОбработкаОбъект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


